src/Catalogs/Мегаордера/Мегаордера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мегаордера</name>
  <predefined>
    <items>
      <name>нулевой</name>
    </items>
  </predefined>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочкаПриема</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>типМегаордера</name>
    <type>
      <types>EnumRef.типМегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Посылка</name>
    <type>
      <types>CatalogRef.Посылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>ТранспортнаяКомпания</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Обмен100сп/Обмен100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Обмен100сп</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтпавкиНаСайт</types>
    </type>
  </resources>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Мегаордер</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>типОбмена</name>
    <type>
      <types>EnumRef.ТипыОбменов100сп</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПакетНаСайт/ПакетНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПакетНаСайт</name>
  <registerRecords>InformationRegister.ОбменССайтом</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтпавкиНаСайт</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Очередь</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ПоступлениеКоробокДляРазбора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазборКоробок</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приходные</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.Приходная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ВозвратПокупокОрганизатору</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходные</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.Расходная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Карты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.КартыУчастников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транзиты</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ВыдачаТранзита</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолученныеДанные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусОтпавкиНаСайт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтчетОДоставке</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ОтчетОДоставке</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормированиеКоробок</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ФормированиеКоробки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтправлениеТранзита</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DocumentRef.ОтправлениеТранзита</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Детально</name>
    <attributes>
      <name>Мегаордер</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбмена</name>
      <type>
        <types>EnumRef.ТипыОбменов100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатОбмена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочкаПриема</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДвижениеУстарело</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Мегаордера/Forms/ФормаМаршрута/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Оповещаем форму документа чтоб перепровести из нее(чтоб объект не похерился)
	Если ТипЗнч(Объект.Покупка) = Тип("ДокументСсылка.ВыдачаТранзита") Тогда
		Оповестить("ПерепровестиДокумент",Объект.Покупка);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	#Область СтарыеОбмены100сп
	Если ЗначениеЗаполнено(Объект.Ссылка) и ТипЗнч(Объект.Покупка) = Тип("ДокументСсылка.ВыдачаТранзита") Тогда
		//Убираем  ответные движения, Будет заново отправлено на ссайт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обмен100сп.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.Обмен100сп КАК Обмен100сп
		|ГДЕ
		|	Обмен100сп.Партия = &Партия
		|	И Обмен100сп.Мегаордер = &Мегаордер
		|	И Обмен100сп.типОбмена = &типОбмена
		|	И ТИПЗНАЧЕНИЯ(Обмен100сп.Регистратор) = ТИП(Документ.ПакетНаСайт)";
		
		Запрос.УстановитьПараметр("Мегаордер", Объект.Ссылка);
		Запрос.УстановитьПараметр("Партия", Объект.Покупка);
		Запрос.УстановитьПараметр("типОбмена", Перечисления.ТипыОбменов100сп.СуперГруппа);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка= РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			пакет=Выборка.Регистратор.ПолучитьОбъект();
			масСтрок=пакет.Детально.НайтиСтроки(Новый Структура("Мегаордер, Партия ,ТипОбмена" ,
			Объект.Ссылка,Объект.Покупка,Перечисления.ТипыОбменов100сп.СуперГруппа));
			Для каждого стр из масСтрок Цикл
				стр.ДвижениеУстарело=Истина;
			КонецЦикла;
			Попытка
				пакет.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести "+пакет.Ссылка);	
				отказ=истина;
			КонецПопытки;
		КонецЦикла;
	Конецесли;
	#КонецОбласти
КонецПроцедуры
